In [1]:
import pandas as pd

In [2]:
id_list = ['hong','hwang','dog','cat']
name_list = ['홍길동','황진이','멍멍이','야옹이']
age_list = [23,25,5,3]
addr_list = ['경기','서울','제주','울릉']

sr1=pd.Series(id_list)
sr2=pd.Series(name_list)
sr1,sr2

(0     hong
 1    hwang
 2      dog
 3      cat
 dtype: object,
 0    홍길동
 1    황진이
 2    멍멍이
 3    야옹이
 dtype: object)

In [3]:
type(sr1)

pandas.core.series.Series

In [4]:
df=pd.DataFrame({'id':id_list,'name':name_list,'age':age_list,'addr':addr_list})

In [10]:
df
print(1)
df

1

      id name  age addr
0   hong  홍길동   23   경기
1  hwang  황진이   25   서울
2    dog  멍멍이    5   제주
3    cat  야옹이    3   울릉

In [11]:
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}

In [12]:
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [13]:
df2 = pd.DataFrame(dict_data)

In [14]:
df2

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [15]:
type(dict_data)

dict

In [30]:
list_data1 = [
             ['홍길동',23,'경기'],
             ['황진이',34,'서울'],
             ['멍멍이',3, '제주'],
             ['야옹이',4, '울릉']
]

In [31]:
list_data1

[['홍길동', 23, '경기'], ['황진이', 34, '서울'], ['멍멍이', 3, '제주'], ['야옹이', 4, '울릉']]

In [36]:
df4 = pd.DataFrame(list_data1,columns=['name','age','addr'])

In [37]:
df4

  name  age addr
0  홍길동   23   경기
1  황진이   34   서울
2  멍멍이    3   제주
3  야옹이    4   울릉

In [38]:
df5 = pd.DataFrame(list_data1,
                   columns=['name','age','addr'],
                   index=['hong','hwang','dog','cat'])

In [40]:
df5

      name  age addr
hong   홍길동   23   경기
hwang  황진이   34   서울
dog    멍멍이    3   제주
cat    야옹이    4   울릉

In [42]:
df5.index,df5.columns

(Index(['hong', 'hwang', 'dog', 'cat'], dtype='object'),
 Index(['name', 'age', 'addr'], dtype='object'))

In [43]:
print(df5.index),print(df5.columns)

Index(['hong', 'hwang', 'dog', 'cat'], dtype='object')
Index(['name', 'age', 'addr'], dtype='object')

(None, None)

In [44]:
df5.columns = ['이름','나이','주소']
df5

        이름  나이  주소
hong   홍길동  23  경기
hwang  황진이  34  서울
dog    멍멍이   3  제주
cat    야옹이   4  울릉

In [45]:
df5.index

Index(['hong', 'hwang', 'dog', 'cat'], dtype='object')

In [46]:
len(df5.index)

4

In [47]:
df5.index = ['학생1','학생2','학생3','학생4']

In [48]:
df5

      이름  나이  주소
학생1  홍길동  23  경기
학생2  황진이  34  서울
학생3  멍멍이   3  제주
학생4  야옹이   4  울릉

In [55]:
list_data = [[15,'남','덕명중'],
             [17,'여','수리중'],
             [16,'남','신라중'],
             [16,'여','신라중']]
list_data

[[15, '남', '덕명중'], [17, '여', '수리중'], [16, '남', '신라중'], [16, '여', '신라중']]

In [58]:
df6 = pd.DataFrame(list_data,
                  columns = ['나이','성별','학교'],
                  index   = ['준서','예은','우현','인아'])

In [59]:
df6

    나이 성별   학교
준서  15  남  덕명중
예은  17  여  수리중
우현  16  남  신라중
인아  16  여  신라중

In [64]:
df7 = df6.copy()
df7.columns = ['연령','남녀','소속']
df7.index = ['학생1','학생2','학생3','학생']

In [ ]:
### column, index명 수정방법
### 일괄수정 df.index = [idx배열],df.columns=[col배열]
### 개별수정 df.rename({'old1':'new1'},{'old2':'new2'},axis='축')

In [74]:
df6

    나이 성별   학교
준서  15  남  덕명중
예은  17  여  수리중
우현  16  남  신라중
인아  16  여  신라중

In [84]:
df7

    나이 성별   학교
준서  15  남  덕명중
예은  17  여  수리중
우현  16  남  신라중
인아  16  여  신라중

In [80]:
# df7 = df6.copy()
df7.rename({'나이':'연령'}) #rename은 index를 기본으로 한다. 그러므로 안바뀐다.

    나이 성별   학교
준서  15  남  덕명중
예은  17  여  수리중
우현  16  남  신라중
인아  16  여  신라중

In [94]:
df7 = df6.copy()
df7.rename({'나이':'연령','성별':'남녀'},axis='columns',inplace=True)

In [95]:
df7.rename({'준서':'학생1','우현':'학생3'},inplace=True)

In [97]:
df7.rename(columns = {'남녀':'성별'})

     연령 성별   학교
학생1  15  남  덕명중
예은   17  여  수리중
학생3  16  남  신라중
인아   16  여  신라중

In [100]:
df7 = df6.copy()

In [103]:
df7
# df.drop('col명',axis = 'columns')  : 1개의 columns 제거
# df.drop('idx명',axis = 'index')    : 1개의 idx 제거
# df.drop(['idx1','idx2',,,,],axis='index')   : 다수의 idx, columns 제거
df7.drop('성별',axis='columns')

    나이   학교
준서  15  덕명중
예은  17  수리중
우현  16  신라중
인아  16  신라중

In [110]:
df7.drop(['준서','인아'],axis ='index',inplace=True)

In [111]:
df7

    나이 성별   학교
예은  17  여  수리중
우현  16  남  신라중

In [112]:
exam_data = {'수학':[ 90,80, 70,60, 70],
             '영어':[ 98,89, 99,90,100],
             '음악':[ 85,95,100,90, 90],
             '체육':[100,99, 98,97, 96]}

In [113]:
exam_data

{'수학': [90, 80, 70, 60, 70],
 '영어': [98, 89, 99, 90, 100],
 '음악': [85, 95, 100, 90, 90],
 '체육': [100, 99, 98, 97, 96]}

In [114]:
df8 = pd.DataFrame(exam_data)

In [115]:
df8

   수학   영어   음악   체육
0  90   98   85  100
1  80   89   95   99
2  70   99  100   98
3  60   90   90   97
4  70  100   90   96

In [116]:
df9 = df8.copy()

In [117]:
df9

   수학   영어   음악   체육
0  90   98   85  100
1  80   89   95   99
2  70   99  100   98
3  60   90   90   97
4  70  100   90   96

In [118]:
df9.index = ['s1','s2','s3','s4','s5']

In [119]:
df9

    수학   영어   음악   체육
s1  90   98   85  100
s2  80   89   95   99
s3  70   99  100   98
s4  60   90   90   97
s5  70  100   90   96

In [134]:
df9['영어']

s1     98
s2     89
s3     99
s4     90
s5    100
Name: 영어, dtype: int64

In [135]:
df9.영어

s1     98
s2     89
s3     99
s4     90
s5    100
Name: 영어, dtype: int64

In [138]:
df9.iloc[-1]

수학     70
영어    100
음악     90
체육     96
합계    170
Name: s5, dtype: int64

In [139]:
df9.loc['s2':'s4']

    수학  영어   음악  체육   합계
s2  80  89   95  99  169
s3  70  99  100  98  169
s4  60  90   90  97  150

In [141]:
df9.loc[['s1','s5','s3']]

    수학   영어   음악   체육   합계
s1  90   98   85  100  188
s5  70  100   90   96  170
s3  70   99  100   98  169

In [142]:
df9.loc['s2']

수학     80
영어     89
음악     95
체육     99
합계    169
Name: s2, dtype: int64

In [143]:
df9['수학']

s1    90
s2    80
s3    70
s4    60
s5    70
Name: 수학, dtype: int64

In [144]:
df8[['수학','영어']]

   수학   영어
0  90   98
1  80   89
2  70   99
3  60   90
4  70  100

In [147]:
df9.loc[['s2','s4']]

    수학  영어  음악  체육   합계
s2  80  89  95  99  169
s4  60  90  90  97  150

In [148]:
df9.iloc[0:2]

    수학  영어  음악   체육   합계
s1  90  98  85  100  188
s2  80  89  95   99  169

In [149]:
df9.iloc[[4,1]]

    수학   영어  음악  체육   합계
s5  70  100  90  96  170
s2  80   89  95  99  169

In [150]:
df9.iloc[0]

수학     90
영어     98
음악     85
체육    100
합계    188
Name: s1, dtype: int64

In [154]:
df9.iloc[-2:]

    수학   영어  음악  체육   합계
s4  60   90  90  97  150
s5  70  100  90  96  170

In [156]:
df9.iloc[[0,-1]]

    수학   영어  음악   체육   합계
s1  90   98  85  100  188
s5  70  100  90   96  170

In [157]:
df9

    수학   영어   음악   체육   합계
s1  90   98   85  100  188
s2  80   89   95   99  169
s3  70   99  100   98  169
s4  60   90   90   97  150
s5  70  100   90   96  170

In [160]:
df9[['음악','수학']]

     음악  수학
s1   85  90
s2   95  80
s3  100  70
s4   90  60
s5   90  70

In [161]:
df9.수학

s1    90
s2    80
s3    70
s4    60
s5    70
Name: 수학, dtype: int64

In [163]:
df9.영어

s1     98
s2     89
s3     99
s4     90
s5    100
Name: 영어, dtype: int64

In [170]:
df9[['수학','음악']]

    수학   음악
s1  90   85
s2  80   95
s3  70  100
s4  60   90
s5  70   90

In [168]:
df9

    수학   영어   음악   체육   합계
s1  90   98   85  100  188
s2  80   89   95   99  169
s3  70   99  100   98  169
s4  60   90   90   97  150
s5  70  100   90   96  170